#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sambaSaturday/sambaSaturday-Worspace2/runs/run-VyhFiPoNAwTLHdFp

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.australia-a-private will be created
  + resource "aws_subnet" "australia-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.44.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "australia-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "australia-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.australia-a-public will be created
  + resource "aws_subnet" "australia-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.44.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "australia-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "australia-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.australia-b-private will be created
  + resource "aws_subnet" "australia-b-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.44.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "australia-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "australia-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.australia-b-public will be created
  + resource "aws_subnet" "australia-b-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.44.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "australia-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "australia-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.california-a-private will be created
  + resource "aws_subnet" "california-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.46.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "california-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "california-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.california-a-public will be created
  + resource "aws_subnet" "california-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.46.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "california-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "california-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.california-c-private will be created
  + resource "aws_subnet" "california-c-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.46.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "california-c-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "california-c-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.california-c-public will be created
  + resource "aws_subnet" "california-c-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.46.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "california-c-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "california-c-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.hong-kong-a-private will be created
  + resource "aws_subnet" "hong-kong-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.45.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "hong-kong-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "hong-kong-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.hong-kong-a-public will be created
  + resource "aws_subnet" "hong-kong-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.45.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "hong-kong-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "hong-kong-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.hong-kong-b-private will be created
  + resource "aws_subnet" "hong-kong-b-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.45.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "hong-kong-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "hong-kong-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.hong-kong-b-public will be created
  + resource "aws_subnet" "hong-kong-b-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.45.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "hong-kong-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "hong-kong-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.london-a-private will be created
  + resource "aws_subnet" "london-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.42.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "london-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "london-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.london-a-public will be created
  + resource "aws_subnet" "london-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.42.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "london-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "london-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.london-b-private will be created
  + resource "aws_subnet" "london-b-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.42.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "london-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "london-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.london-b-public will be created
  + resource "aws_subnet" "london-b-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.42.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "london-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "london-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.new-york-a-private will be created
  + resource "aws_subnet" "new-york-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.41.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "new-york-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "new-york-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.new-york-a-public will be created
  + resource "aws_subnet" "new-york-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.41.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "new-york-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "new-york-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.new-york-b-private will be created
  + resource "aws_subnet" "new-york-b-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.41.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "new-york-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "new-york-b-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.new-york-b-public will be created
  + resource "aws_subnet" "new-york-b-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.41.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "new-york-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "new-york-b-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.sao-paulo-a-private will be created
  + resource "aws_subnet" "sao-paulo-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.43.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "sao-paulo-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "sao-paulo-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.sao-paulo-a-public will be created
  + resource "aws_subnet" "sao-paulo-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.43.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "sao-paulo-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "sao-paulo-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.sao-paulo-c-private will be created
  + resource "aws_subnet" "sao-paulo-c-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.43.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "sao-paulo-c-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "sao-paulo-c-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.sao-paulo-c-public will be created
  + resource "aws_subnet" "sao-paulo-c-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.43.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "sao-paulo-c-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "sao-paulo-c-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.tokyo-a-private will be created
  + resource "aws_subnet" "tokyo-a-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.40.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "tokyo-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "tokyo-a-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.tokyo-a-public will be created
  + resource "aws_subnet" "tokyo-a-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.40.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "tokyo-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "tokyo-a-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.tokyo-d-private will be created
  + resource "aws_subnet" "tokyo-d-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.40.14.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "tokyo-d-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "tokyo-d-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.tokyo-d-public will be created
  + resource "aws_subnet" "tokyo-d-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.40.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "tokyo-d-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "tokyo-d-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.tokyo-testa-public will be created
  + resource "aws_subnet" "tokyo-testa-public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.47.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "tokyo-testa-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "tokyo-testa-public"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.tokyo-testb-private will be created
  + resource "aws_subnet" "tokyo-testb-private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.47.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "tokyo-testb-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                                       = {
          + "Name"    = "tokyo-testb-private"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.australia will be created
  + resource "aws_vpc" "australia" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.44.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "australia"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "australia"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.california will be created
  + resource "aws_vpc" "california" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.46.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "california"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "california"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.hong-kong will be created
  + resource "aws_vpc" "hong-kong" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.45.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "hong-kong"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "hong-kong"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.london will be created
  + resource "aws_vpc" "london" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.42.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "london"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "london"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.new-york will be created
  + resource "aws_vpc" "new-york" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.41.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "new-york"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "new-york"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.sao-paulo will be created
  + resource "aws_vpc" "sao-paulo" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.43.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "sao-paulo"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "sao-paulo"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.tokyo will be created
  + resource "aws_vpc" "tokyo" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.40.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "tokyo"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "tokyo"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

  # aws_vpc.tokyo-testb will be created
  + resource "aws_vpc" "tokyo-testb" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.47.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "tokyo-testb"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
      + tags_all                             = {
          + "Name"    = "tokyo-testb"
          + "Owner"   = "camorri"
          + "Service" = "armageddon"
        }
    }

Plan: 38 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @caseyjakemorris, Action: `pull_request`*